# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
# N = 6 | N = 12 | 32 | 13 | 9 | 18 | 21
# 2 * 3 | 2 * 2 * 3 | 2 * 2 * 2 * 2 * 2 | 13 | 3 * 3 | 2 * 3 * 3 | 3*7

num = int(input("N = "))

Spisok = []
i = 2
while i <= num:
    if num % i == 0:
        Spisok.append(i)
        num //= i
    else:
        i += 1

print(Spisok)        
